# Код Морзе для представления цифр и букв 
# использует тире и точки.
# Напишите программу для кодирования текстового 
# сообщения в соответствии с кодом Морзе.

letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....',
         '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.',
         '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-',
         '-.--', '--..', '-----', '.----', '..---', '...--',
         '....-', '.....', '-....', '--...', '---..', '----.']

coding_morse = dict(zip(letters, morse))
# print(coding_morse)
s = 'Hello, World!'.replace(' ', '').upper()
# print(s)
for i in s:
    if i in letters:
        print(coding_morse[i], end=' ')
