# Напишите программу, которая считывает натуральное число n и выводит первые
# n чисел последовательности Трибоначчи.

# Формат входных данных
# На вход программе подается одно число
# (n≤100)
# n (n≤100) – количество членов последовательности.

# Формат выходных данных
# Программа должна вывести члены последовательности Трибоначчи, отделенные символом пробела.

# Примечание. Последовательность Трибоначчи – последовательность натуральных чисел, где
# каждое последующее число является суммой трех предыдущих:

# 1,1,1,3,5,9,17,31,57,105 …

# число фибоначи
# n = int(input('n = '))
# f1, f2 = 1, 1
# for i in range(n):
#     print(f1, end=' ')
#     f1, f2 = f2, f1 + f2

n = int(input('n = '))
f1, f2, f3 = 1, 1, 1
for i in range(n):
    print(f1, end=' ')
    f1, f2, f3 = f2, f3, f1 + f2 + f3
