# Даны по 10-балльной шкале оценки по биологии трех учеников.
# Напишите программу, которая выводит множество оценок,
# не встречающихся ни у одного из трех учеников.



s0 = set(int(i) for i in '0 1 2 3 4 5 6 7 8 9 10'.split())

s1 = set(int(i) for i in '1 5 4 2 5 6 6 2 3 3 5 2'.split())
s2 = set(int(i) for i in '2 3 5 1 2 1 2 6 7 1 1 6'.split())
s3 = set(int(i) for i in '1 4 6 8 8 7 0 6 0 3 8 1'.split())

print(*sorted(s0.difference(s1, s2, s3)))